Merge pull request #66 from rewhowe/develop
v2.1.0
